{"class_name": "Sequential", "keras_version": "2.1.6", "backend": "tensorflow", "config": [{"class_name": "Dense", "config": {"bias_constraint": null, "dtype": "float32", "name": "dense_1", "trainable": true, "use_bias": true, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_regularizer": null, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "kernel_regularizer": null, "activity_regularizer": null, "batch_input_shape": [null, 4]}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_2", "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "relu", "bias_regularizer": null, "units": 50, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}, {"class_name": "Dense", "config": {"bias_constraint": null, "name": "dense_3", "trainable": true, "use_bias": true, "kernel_constraint": null, "activity_regularizer": null, "activation": "linear", "bias_regularizer": null, "units": 2, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null}}]}