{"class_name": "Sequential", "backend": "tensorflow", "keras_version": "2.1.6", "config": [{"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "batch_input_shape": [null, 8], "activity_regularizer": null, "kernel_constraint": null, "dtype": "float32", "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_7", "bias_regularizer": null, "activation": "relu", "units": 50, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_8", "bias_regularizer": null, "activation": "relu", "units": 50, "trainable": true}}, {"class_name": "Dense", "config": {"use_bias": true, "bias_constraint": null, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "activity_regularizer": null, "kernel_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "name": "dense_9", "bias_regularizer": null, "activation": "linear", "units": 4, "trainable": true}}]}