{"config": [{"config": {"activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "batch_input_shape": [null, 4], "bias_constraint": null, "dtype": "float32", "trainable": true, "units": 50}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "activation": "relu", "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 50, "trainable": true}, "class_name": "Dense"}, {"config": {"activity_regularizer": null, "kernel_constraint": null, "activation": "linear", "use_bias": true, "kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "kernel_initializer": {"config": {"mode": "fan_avg", "seed": null, "distribution": "uniform", "scale": 1.0}, "class_name": "VarianceScaling"}, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "units": 2, "trainable": true}, "class_name": "Dense"}], "keras_version": "2.1.6", "backend": "tensorflow", "class_name": "Sequential"}